{
  "version": "1.1",
  "cards": [
    {
      "id": "34-hate-crime-on-the-5",
      "name": "A Targeted Hate Crime (On Their Pos 5)",
      "tagline": "Your lane is a documentary about bullying (with educational value).",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "easy",
      "rule": "For the first 8 minutes, you may only commit for kills if the enemy Pos 5 is in the area. Ignore the carry unless the 5 dies first.",
      "win": "Force the enemy support to TP back to lane twice or abandon the lane by minute 8.",
      "why": "Teaches target prioritization and how removing enemy support regen/pressure wins lanes.",
      "spice": "Every time the 5 dies, say: “We are improving their character.”",
      "warning": "If you tunnel too hard and miss free carry kills, you owe your carry an apology ping."
    },
    {
      "id": "34-no-coward-tps",
      "name": "No Coward TPs",
      "tagline": "If you TP, it better be a crime scene.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "high",
      "difficulty": "medium",
      "rule": "You are only allowed to TP in response to an enemy dive or to force a fight. No defensive ‘save tower’ TPs.",
      "win": "Win one TP-reaction fight where you get 2+ kills and take an objective right after.",
      "why": "Teaches TP discipline: reacting to enemy mistakes beats passive map-sitting.",
      "spice": "After a successful TP, type: “Map punished.”",
      "warning": "If your tower falls and you didn’t fight, do NOT tilt — that’s the lesson."
    },
    {
      "id": "34-two-wave-tax",
      "name": "The Two-Wave Tax",
      "tagline": "We’re not stealing farm, we’re collecting taxes.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "easy",
      "rule": "After minute 6, every time you get a kill or force the carry to retreat, you must immediately shove TWO waves into their tower (together).",
      "win": "Take offlane tower by minute 12.",
      "why": "Teaches turning kills into waves into objectives — real offlane fundamentals.",
      "spice": "Announce: “Paying the tax,” before shoving.",
      "warning": "Don’t shove alone into fog. You’re a duo. Act like it."
    },
    {
      "id": "34-smoke-by-12",
      "name": "Mandatory Smoke By 12",
      "tagline": "If you’re not smoking, you’re basically farming in public.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "medium",
      "rule": "Buy a Smoke and use it before minute 12. Your first smoke target must be either mid or enemy triangle entrance.",
      "win": "Get one pickoff AND immediately convert it into a tower hit / warding their jungle / stealing a stack.",
      "why": "Teaches early tempo smokes and conversion (not just ‘kill then AFK’).",
      "spice": "Before smoking: “We are professionals.”",
      "warning": "If it fails, don’t force a second fight. Disengage like adults."
    },
    {
      "id": "34-ward-bounty-contract",
      "name": "The Ward Bounty Contract",
      "tagline": "Vision is paid in blood, not gold.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "medium",
      "rule": "You place exactly ONE aggressive ward before minute 8. If the ward survives 2+ minutes, you must play around it and force action there.",
      "win": "Win a fight because your ward saw a rotation first.",
      "why": "Teaches purposeful warding: place vision only when you intend to use it.",
      "spice": "Name the ward location in voice like it’s a restaurant reservation.",
      "warning": "If you place a ward and ignore it, you are legally a support griefer."
    },
    {
      "id": "34-stance-switching",
      "name": "Stance Switching: Bully → Adult",
      "tagline": "Minute 10: we stop cosplaying and start winning.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "hard",
      "rule": "Minutes 0–10: play maximum pressure (harass, contest pulls, punish). Minutes 10–18: play ‘adult Dota’ — no chasing past vision, only fights around waves/objectives.",
      "win": "After minute 10, take 2 good fights with zero overchase deaths.",
      "why": "Teaches the biggest pub skill: knowing when to stop brawling and start converting.",
      "spice": "At 10:00 say: “The fun is over. Now we pay bills.”",
      "warning": "Your brain will try to chase. Resist it."
    },
    {
      "id": "34-pull-police",
      "name": "The Pull Police",
      "tagline": "Some people commit crimes. We commit pull interference.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "medium",
      "rule": "You must block or punish at least THREE enemy pulls by minute 7 (block camp, contest pull, or kill support during pull).",
      "win": "Enemy carry is stuck under tower with bad lane equilibrium for 2+ waves.",
      "why": "Teaches lane equilibrium and why support movement matters more than random trading.",
      "spice": "Every blocked pull: “Not on my watch.”",
      "warning": "Don’t die alone in their jungle. Bring the offlaner or bring a sentry plan."
    },
    {
      "id": "34-save-your-stun",
      "name": "Save Your Stun (You Gremlin)",
      "tagline": "You don’t need to press everything immediately. Shocking, I know.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "hard",
      "rule": "In every fight, one of you must hold your main disable until the enemy uses a mobility spell (blink/dash/force) OR BKB.",
      "win": "Win one midgame fight where your held stun directly catches the enemy core after they ‘escape’.",
      "why": "Teaches spell discipline, patience, and actual catch timing.",
      "spice": "If you succeed, say: “I waited. Like a predator.”",
      "warning": "If you panic-cast, you must admit it out loud. Pain teaches."
    },
    {
      "id": "34-tower-before-roam",
      "name": "Tower Before Roam",
      "tagline": "No roaming until you break their home.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "medium",
      "rule": "You are not allowed to leave the lane together until you’ve either taken the offlane tower OR forced 3 enemy TPs to defend it.",
      "win": "Force 3 TPs or take tower by minute 12.",
      "why": "Teaches objective pressure and how to create map space without random wandering.",
      "spice": "Call the tower “the mortgage.” You must pay it off.",
      "warning": "If mid is dying nonstop, you can rotate — but only one of you."
    },
    {
      "id": "34-chain-feed-into-win",
      "name": "Chain Feed Into Win (Controlled)",
      "tagline": "We are not feeding. We are baiting. Intelligently. Allegedly.",
      "roles_key": "3+4",
      "roles_text": "You: Pos 4 • Friend: Pos 3",
      "mode": "ranked_ok",
      "tilt": "high",
      "difficulty": "hard",
      "rule": "Once per game, you intentionally show on a risky wave to bait a rotation. The other must be ready nearby with a counter-initiation. You get ONE attempt.",
      "win": "Turn the bait into 2 kills or a tower/rosh.",
      "why": "Teaches reading enemy rotations and punishing over-commitment with positioning.",
      "spice": "Announce: “I’m presenting myself as content.”",
      "warning": "If you do it without backup, that’s not bait — that’s a solo queue confession."
    },
    {
      "id": "15-support-captain",
      "name": "Support Captain Protocol",
      "tagline": "Carry is a passenger. Support is the GPS.",
      "roles_key": "1+5",
      "roles_text": "You: Pos 5 • Friend: Pos 1",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "medium",
      "rule": "For the first 15 minutes, pos 5 makes the macro calls (when to pull, when to trade, when to go jungle, when to fight). Carry must follow without debate.",
      "win": "Win lane OR stabilize into a good timing without carry dying more than once pre-10.",
      "why": "Teaches communication, lane management, and carry discipline (not chasing dopamine).",
      "spice": "Carry says “yes chef” after each call.",
      "warning": "If you argue mid-call, you auto-lose the card."
    },
    {
      "id": "15-no-regen-wars",
      "name": "No Regen Wars (Pure Fundamentals)",
      "tagline": "Stop buying sadness. Start buying correctness.",
      "roles_key": "1+5",
      "roles_text": "You: Pos 5 • Friend: Pos 1",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "hard",
      "rule": "You are not allowed to ‘out-regen’ bad trading. If you take a bad trade twice, you must change the lane plan (pull, creep aggro, reposition).",
      "win": "Win lane equilibrium (carry farming safely) with minimal wasted regen by minute 7.",
      "why": "Teaches proper trading patterns, aggro, and support positioning instead of brute forcing with tangos.",
      "spice": "Say: “We choose intelligence,” before resetting lane.",
      "warning": "If you keep losing trades and just buy more regen, you owe a therapy session to your wallet."
    },
    {
      "id": "15-lane-silence",
      "name": "Lane Silence Challenge",
      "tagline": "No pings. No blame. Only information.",
      "roles_key": "1+5",
      "roles_text": "You: Pos 5 • Friend: Pos 1",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "medium",
      "rule": "For the first 10 minutes: no complaining, no sarcasm, no ping spam. Only info: cooldowns, missing heroes, pull timers.",
      "win": "Make 3 correct lane decisions based on info (dodging gank, turning, pulling, backing).",
      "why": "Teaches calm comms and reduces tilt — you’ll literally play better.",
      "spice": "If someone flames you, respond with: “Information received.”",
      "warning": "This card causes emotional growth. Side effects include winning."
    },
    {
      "id": "15-anti-greed-ward",
      "name": "Anti-Greed Ward and Punish",
      "tagline": "They want one more wave. We want their life.",
      "roles_key": "1+5",
      "roles_text": "You: Pos 5 • Friend: Pos 1",
      "mode": "ranked_ok",
      "tilt": "medium",
      "difficulty": "easy",
      "rule": "Place ONE lane ward that specifically watches the enemy carry’s greedy step (their small camp, side shop area, or behind tower path). The first time you see greed, you must punish together.",
      "win": "Get one kill from vision OR force the carry out of lane and take a plate of farm.",
      "why": "Teaches vision with a plan + synchronized punish timings.",
      "spice": "Announce: “Greed detected.” like a robot.",
      "warning": "If you see them and do nothing, the ward will judge you."
    },
    {
      "id": "24-mid-roamer-contract",
      "name": "Mid-Roamer Contract",
      "tagline": "Mid gets a bodyguard. Roamer gets a purpose.",
      "roles_key": "2+4",
      "roles_text": "You: Pos 2 • Friend: Pos 4",
      "mode": "ranked_ok",
      "tilt": "low",
      "difficulty": "hard",
      "rule": "Your first rotation must be triggered by a clear condition: rune spawn, catapult wave, or enemy mid using escape. No random roaming. Say the condition out loud first.",
      "win": "Get one successful rune-based gank OR win catapult timing into tower damage.",
      "why": "Teaches structured rotations and timing-based moves (not vibe-based).",
      "spice": "Before moving, say: “According to the contract…”",
      "warning": "If you roam without a condition, you owe a public apology to the minimap."
    }
  ]
}
